; =============================================================================
; /kernel/tty_syscall.asm - ВЫСОКОУРОВНЕВЫЕ СИСТЕМНЫЕ ВЫЗОВЫ ТЕРМИНАЛА
; =============================================================================

; -----------------------------------------------------------------------------
; СИСКОЛЛ: sys_tcgetattr (POSIX tcgetattr)
; -----------------------------------------------------------------------------
; Вход:  DE = Логический адрес структуры termios в памяти Ring 3 (в Окне 2).
; Выход: A  = 00H (Чистый успех), c_lflag скопирован пользователю.
; -----------------------------------------------------------------------------
sys_tcgetattr:
    PUSH B
	PUSH D
	PUSH H

    LDA  TTY_C_LFLAG
    MOV  C, A                       ; C = Текущая дисциплина линии из ядра

    ; Включаем Kernel Override для записи байта напрямую в Окно 2 Ring 3
    MVI  A, KERNEL_OVERRIDE_ON
    OUT  EMMU_OVERRIDE             	; Открыли Сегмент 2 на User RAM [1.3]
    
    MOV  A, C
    STAX D                          ; ДАННЫЕ ОФИЦИАЛЬНО ПЕРЕНЕСЕНЫ В ЮЗЕРСПЕЙС!
    
    MVI  A, KERNEL_OVERRIDE_OFF
    OUT  EMMU_OVERRIDE             ; Аппаратно закрываем оверран памяти [1.3]

    POP  H
	POP  D
	POP  B
    MVI  A, 00h                     ; Возвращаем успех
    RET

; -----------------------------------------------------------------------------
; СИСКОЛЛ: sys_tcsetattr (POSIX tcsetattr)
; -----------------------------------------------------------------------------
; Вход:  DE = Логический адрес структуры termios в памяти Ring 3 (в Окне 2).
; Выход: A  = 00H (Чистый успех), параметры применены.
; -----------------------------------------------------------------------------
sys_tcsetattr:
    PUSH B
	PUSH D
	PUSH H

    ; Читаем байт конфигурации напрямую из Окна 2 памяти Ring 3
    MVI  A, KERNEL_OVERRIDE_ON
    OUT  EMMU_OVERRIDE             	; Открыли Сегмент 2 на User RAM [1.3]
    
    LDAX D                          ; Извлекли новые флаги из юзерспейса
    MOV  C, A
    
    MVI  A, KERNEL_OVERRIDE_OFF
    OUT  EMMU_OVERRIDE             ; Аппаратно закрываем оверран памяти [1.3]
    
    MOV  A, C
    STA  TTY_C_LFLAG                ; ДИСЦИПЛИНА ЛИНИИ МГНОВЕННО ОБНОВЛЕНА В ЯДРЕ!

    POP  H
	POP  D
	POP  B
    MVI  A, 00h
    RET
